---
type: BuildingEnvelopeAnalyzerOptions
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 6
tags: [revit-api, class]
---

# BuildingEnvelopeAnalyzerOptions

`Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BuildingEnvelopeAnalyzerOptions | 2015 | `public BuildingEnvelopeAnalyzerOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AnalyzeEnclosedSpaceVolumes | 2015 | `public bool AnalyzeEnclosedSpaceVolumes { get ; set ; }` |
| Property | GridCellSize | 2015 | `public double GridCellSize { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OptimizeGridCellSize | 2015 | `public bool OptimizeGridCellSize { get ; set ; }` |